OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/multiphase/multiphaseEulerFoam/RAS/bubblePipe/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    injection;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
           boxes
           (
                (0 -1 0.0) (0.005 1 0.01)
           );
        }
    }

    {
        name    injection;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
           set  injection;
        }
    }

    {
        name    outlet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
           boxes
           (
                (0 -1 0.89) (0.025 1 0.9)
           );
        }
    }

    {
        name    outlet;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
           set  outlet;
        }
    }
);

// ************************************************************************* //
